<?php

return [
        'name.required' => 'الرجاء ادخال اسم الموظف',
        'name.string' => 'اسم الموظف يجب ان يكون نص',
        'name.max' => 'الحد الأقصى لعدد الاحرف هو 255 حرف',
        ///////////////////////////////////////////////////////////////
        'phone_number.required' => 'الرجاء ادخال رقم الجوال',
        'phone_number.string' => 'رقم الجوال يجب ان يكون نص',
        'phone_number.max' => 'الحد الأصى  لعدد خانات رقم الجوال هي 14 خانة',
        'phone_number.unique' => 'رقم الجوال موجود مسبقا',
        ///////////////////////////////////////////////////////////////
        'email.required' => 'الرجاء ادخال البريد الالكتروني',
        'email.email' => 'البريد الاكلتورني يجب ان يتبع صيغة البريد ',
        'email.unique' => 'البريد الالكتروني موجود مسبقا',
        /////////////////////////////////////////////////////////////
        'password.required' => 'الرجاء ادخال كلمة المرور',
        'password.string' => 'كلمة المرور يجب ان تكون من نوع نص',
        'password.min' => 'الحد الأدنى لكلمة المرور 6 خانات',
        'password.max' => 'الحد الأقصى لكلمة المرور 20 خانة',
        ////////////////////////////////////////////////////
        'gender.required' => 'الرجاء ادخال الجنس',
        'gender.string' => 'الجنس  يجب ان يكون نص',
        'gender.max' => 'الحد الأقصى لعدد الاحرف هو 12 حرف',
        ///////////////////////////////////////////////////////////////
        'address.string' => 'العنوان يجب ان يكون نص',
        'address.max' => 'الحد الأقصى لعدد الاحرف هو 255 حرف',
        ///////////////////////////////////////////////////////////////
        'role.required' => 'الرجاء ادخال الصلاحية ',
        'role.string' => 'الصلاحية يجب ان يكون نص',
        'role.max' => 'الحد الأقصى لعدد الاحرف هو 255 حرف',
        'role.exists' => 'الصلاحية  غير موجودة',
        'image.required' => 'الرجاء ادخال الصورة ',
        'image.mimes' => 'صيغة الصورة يجب ان تكون احد الاتي : png, jpg, jpeg, gif',
    

    ];